Repository: peerwaya/cryptoplease-dart
Catalog: packages/espressocash_app/lib/l10n/intl_*.arb
Languages: es, fr, pt, ru

# activities_lblAddCash
source: Deposit
es: Agregar efectivo
fr: Ajouter de l'argent
ru: Добавьте наличные

# activities_lblCanceled
source: Canceled
es: Cancelada
fr: Annulé
pt: Cancelada
ru: Отменено

# activities_lblFailure
source: Failure
es: Falla
fr: Echec
pt: Falha
ru: Сбой

# activities_lblInProgress
source: In Progress
es: En curso
fr: En cours
pt: Em andamento
ru: Выполняется

# activities_lblSuccess
source: Success
es: Éxito
fr: Succès
pt: Sucesso
ru: Успешно

# activities_lblTitle
source: Activity
es: Actividad
fr: Activité
pt: Atividade
ru: Операции

# activities_lblWithdraw
source: Withdraw
es: Retirar efectivo
fr: Retirer de l'argent
ru: Обналичить

# appLock_lblAutoLock
source: Auto-Lock
es: Bloqueo automático
fr: Verrouillage automatique
pt: Bloqueio automático
ru: Автоматическая блокировка

# appLock_lblAutoLockDescription
source: Require passcode to access the app
es: Requiere contraseña para acceder a la aplicación
fr: Exiger le code d'accès pour accéder à l'application
pt: Requer senha para acessar o aplicativo
ru: Требовать пин-код для доступа к приложению

# balances_lblConnectionError
source: Cannot connect to the network!
es: ¡No se puede conectar a la red!
fr: Impossible de se connecter au réseau!
pt: Não foi possível conectar-se à rede!
ru: Не удается подключиться к сети!

# carousel1Subtitle
source: Instant & Low Fee Money Transfers to 200+ Countries & Territories.
es: Transferencias de dinero instantáneas, con tarifas bajas a más de 200 países y territorios.
fr: Transfert d'argent instantané à faible coût vers plus de 200 pays et territoires.
ru: Мгновенные денежные переводы с низкой комиссией в более чем в 200 стран и территорий.

# carousel1Title
source: Welcome to Espresso Cash!
es: Bienvenido a Espresso Cash
fr: Bienvenue sur Espresso Cash !
ru: Добро пожаловать в Espresso Cash!

# carousel2Subtitle
source: The Money Gets Transferred to Their Bank Account as Local Currency.
es: El dinero se transfiere a su cuenta bancaria en moneda local.
fr: L'argent est transféré sur leur compte bancaire en tant que monnaie locale.
ru: Деньги переводятся на Ваш банковский счет в местной валюте.

# carousel2Title
source: Send Money Home In Seconds
es: Envía dinero a casa en segundos
fr: Envoyez de l'argent chez vous en quelques secondes
ru: Вывод наличных в местной валюте

# carousel3Subtitle
source: Payments are shared using messaging platforms like WhatsApp, Messenger, Telegram or SMS.
es: Los pagos se comparten mediante plataformas de mensajería como WhatsApp, Messenger, Telegram o SMS.
fr: Les paiements sont partagés via des plateformes de messagerie telles que WhatsApp, Messenger, Telegram ou SMS.
ru: Платежи распределяются с помощью платформ обмена сообщениями, таких как WhatsApp, Messenger, Telegram или SMS.

# carousel3Title
source: Send With Messaging Platforms
es: Enviar a través de plataformas de mensajería
fr: Envoyer via des plateformes de messagerie
ru: Отправляйте с помощью платформ обмена сообщениями

# carousel4Subtitle
source: Use an Espresso Cash QR Code to Instantly Pay Local Businesses
es: Utiliza un código QR de Espresso Cash para pagar al instante en negocios locales.
fr: Utilisez un code QR Espresso Cash pour payer instantanément les entreprises locales.
ru: Используйте QR-код Espresso Cash для мгновенной оплаты местным предприятиям

# carousel4Title
source: Pay Locally
es: Paga Localmente
fr: Payer Localement
ru: Оплачивайте на месте

# carouselSendMoneyBtn
source: Send Money Now
es: Envía Dinero Ahora
fr: Envoyez de l'argent
ru: Отправьте деньги прямо сейчас

source: Close
ru: Закрыть

source: Coming soon!
es: ¡Muy pronto!
fr: À venir!
pt: Em breve!
ru: Скоро будет!

source: Contact Us
es: Contáctenos
fr: Contactez-nous
pt: Contate-nos
ru: Связаться с нами

# copiedFid
source: Copied FID: {fid}
es: Copiada FID: {fid}
fr: FID copié: {fid}
pt: FID copiado: {fid}
ru: Скопирован FID: {fid}

# copiedToClipboard
source: Copied!
es: ¡Copiada!
fr: Copié!
pt: Copiado!
ru: Скопировано!

source: Copy
es: Copiar
fr: Copier
pt: Copiar
ru: Копировать

# core_and
source: and
es: et
pt: y
ru: и

# core_btnCancel
source: Cancel
es: Cancelar
fr: Annuler
pt: Cancelar
ru: Отменить

source: Country of residence
es: País de residencia
fr: Pays de résidence
ru: Страна проживания

source: Create
es: Crear
fr: Créer
pt: Criar
ru: Создать

# cryptoCashBalance
source: Cash Balance
es: Tu Efectivo
fr: Votre Cash
pt: Seu Saldo Cripto
ru: Ваш баланс

# depositDisclaimer
source: Funds must be sent from your personal account. Any funds sent through an account that does not match your identification details will be reserved.
es: Los fondos deben ser enviados desde tu cuenta personal. Cualquier fondo enviado a través de una cuenta que no coincida con los detalles de tu identificación será reservado.
fr: Les fonds doivent être envoyés depuis votre compte personnel. Tout fonds envoyé via un compte qui ne correspond pas à vos détails d'identification sera réservé.
ru: Средства должны быть отправлены с вашего личного счета. Любые средства, отправленные через счет, который не соответствует вашим идентификационным данным, будут зарезервированы.

# depositInstruction1
source: Transfer money from your bank account to our local partner:
es: Transfiere dinero desde tu cuenta bancaria a nuestro socio local:
fr: Transférez de l'argent depuis votre compte bancaire vers notre partenaire local :
ru: Переведите деньги с вашего банковского счета нашему местному партнеру:

# depositInstruction2
source: Once money has been transferred, return to Espresso Cash and continue below.
es: Una vez que el dinero haya sido transferido, regresa a Espresso Cash y continúa a continuación.
fr: Une fois que l'argent a été transféré, retournez sur Espresso Cash et continuez ci-dessous.
ru: Как только деньги будут переведены, вернитесь в Espresso Cash и продолжайте ниже.

# depositReceiveAmount
source: You will receive: {amount}
es: Recibirás: {amount}
fr: Vous recevrez : {amount}
ru: Вы получите: {amount}

# depositTitle
source: Deposit
es: Agregar efectivo
fr: Ajouter de l'argent
ru: Добавьте наличные

# depositTransferAmount
source: Amount to be transferred
es: Monto a transferir
fr: Montant à transférer
ru: Сумма, подлежащая переводу

source: Edit Profile
es: Editar perfil
fr: Editer mes infos
pt: Editar Perfil
ru: Редактировать профиль

source: Enter amount
es: Ingresar la cantidad
fr: Entrer le montant
pt: Insira o valor
ru: Введите сумму

# enterPasscode
source: Enter your passcode
es: Introduzca su código de acceso
fr: Entre ton code d'accès
pt: Insira sua senha
ru: Введите пин-код

# enterYourSecretWords
source: Enter Your Secret Recovery Phrase
es: Ingrese su frase de recuperación secreta
fr: Entrez votre phrase de récupération secrète
pt: Digite sua Frase de Recuperação Secreta
ru: Введите секретную фразу для восстановления

# errorMessageInsufficientFunds
source: You do not have enough funds.
es: No tienes suficientes fondos.
fr: Vous n'avez pas assez de fonds.
pt: Você não tem saldo suficiente.
ru: У Вас недостаточно средств.

# faq
source: Frequently Asked Questions (FAQ)
es: Preguntas frecuentes
fr: Questions fréquemment posées (FAQ)
pt: Perguntas frequentes (FAQ)
ru: Часто задаваемые вопросы (FAQ)

# feeAmount
source: Fee: {value}
es: Tarifa: {value}
fr: Frais: {value}
pt: Taxa: {value}
ru: Комиссия: {value}

# feesCalculating
source: calculating...
es: calculando...
fr: En train de calculer...
pt: Calculando...
ru: вычисление...

# feesFailed
source: failed to load
es: falló al cargar
fr: Echec du chargement
pt: Falha ao carregar
ru: не удалось загрузить

# fiatEquivalent
source: Equivalent to {value}
es: Equivalente a {value}
fr: Équivalent à {value}
pt: Equivalente a {value}
ru: Эквивалентно {value}

# incomingUsdcFeeNotice
source: You were charged a one time {amount} fee for your first incoming transaction.
es: Se te ha cobrado una tarifa única de $0.10 por tu primera transacción entrante.
fr: Un frais unique de {amount} a été prélevé pour votre première transaction entrante.
ru: С вас была снята единовременная комиссия в размере {amount} за вашу первую входящую транзакцию.

# incorrectPasscode
source: Incorrect passcode. Retry again
es: código de acceso incorrecto.Volver a intentarlo
fr: Code d'accès incorrect. Réessayer à nouveau
pt: Senha incorreta. Tente novamente
ru: Неверный пин-код. Попробуйте еще раз.

# insufficientFundsMessage
source: You cannot send {amount}, you only have {balance} available.
es: No puedes enviar {amount}, tu solo tienes {balance} disponible.
fr: Vous ne pouvez pas envoyer{amount}, tu as seulement {balance} de disponible.
pt: Você não pode enviar {amount}, você só tem {balance} disponível.
ru: Вы не можете отправить {amount}, Вам доступно только {balance}.

source: in USDC
es: en USDC
fr: en USDC
pt: em USDC
ru: в USDC

# invalidEscrowError
source: The link is incorrect or the money has already been withdrawn.
es: El enlace es incorrecto o el dinero ya se ha retirado.
fr: Le lien est incorrect ou l'argent a déjà été retiré.
pt: O link está incorreto ou o dinheiro já foi retirado.
ru: Ссылка неверна или деньги уже были выведены.

# investmentHeaderButtonsTitle
source: I want to
es: Yo quiero
fr: Je veux
pt: Eu quero
ru: Я хочу

source: I Understand
es: Entiendo
fr: Je comprends
pt: Eu entendi
ru: Я понимаю

# iUnderstandIfLoseMySecret
source: I understand that if I lose my Secret Recovery Phrase I will not be able to access funds.
es: Entiendo que si pierdo mi frase de recuperación secreta, no podré acceder a fondos.
fr: Je comprends que si je perds ma phrase de récupération secrète, je ne pourrai pas accéder aux fonds.
pt: Entendo que, se perder minha frase de recuperação secreta, não poderei acessar os ativos.
ru: Я понимаю, что если я потеряю свою секретную фразу восстановления, я не смогу получить доступ к средствам.

source: Loading...
es: Cargando...
fr: Chargement...
pt: Carregando...
ru: Загрузка...

# minAmountToOffRamp
source: {amount} is the minimum you can cash out
fr: {amount} est le montant minimum que vous pouvez retirer
ru: {amount} это минимум, который вы можете обналичить

# minAmountToOnRamp
source: {amount} is the minimum you can add
es: {amount} es el mínimo que puedes añadir
fr: {amount} est le montant minimum que vous pouvez ajouter
ru: {amount} - это минимум, который вы можете добавить

# minimumAmountToRequest
source: {amount} is the minimum to request
es: {amount} es el mínimo de solicitar
fr: {amount} est le minimum pour demander
pt: {amount} é o mínimo para solicitar
ru: {amount} это минимум, который можно запросить

# minimumAmountToSend
source: {amount} is the minimum to send
es: {amount} es el mínimo para enviar
fr: {amount} est le minimum à envoyer
pt: {amount} é o mínimo para enviar
ru: {amount} это минимум для отправки

# mobileWalletAcceptAuthorization
source: Authorize
es: Autorizar
fr: Autoriser
pt: Autorizar
ru: Авторизовать

# mobileWalletAcceptSignAndSendPayloads
source: Sign and Send
es: Firmar y enviar
fr: Signer et envoyer
pt: Assinar e enviar
ru: Подписать и отправить

# mobileWalletAcceptSignMessages
source: Sign Messages
es: Firmar mensajes
fr: Signer des messages
pt: Assinar mensagens
ru: Подписать сообщения

# mobileWalletAcceptSignTransactions
source: Sign Transactions
es: Firmar transacciones
fr: Signer des transactions
pt: Assinar transações
ru: Подписать транзакции

# mobileWalletAuthorize
source: Authorize {appName}?
es: {appName}¿Autorizar?
fr: Autoriser {appName}?
pt: Autorizar {appName}?
ru: Авторизовать {appName}?

# mobileWalletSendTransactions
source: These transactions will be immediately submitted after signing.
es: Estas transacciones se enviarán inmediatamente después de la firma.
fr: Ces transactions seront envoyées immédiatement après la signature.
pt: Essas transações serão imediatamente enviadas após serem assinadas.
ru: Эти транзакции будут отправлены сразу после подписания.

# mobileWalletSignAndSendTransactions
source: Sign and Send Transaction(s)
es: Firmar y enviar transacciones
fr: Signer et envoyer les transactions
pt: Assinar e Enviar Transações
ru: Подписать и отправить транзакцию(и)

# mobileWalletSignMessages
source: Sign Message
es: Firmar mensaje
fr: Signer le message
pt: Assinar mensagem
ru: Подписать сообщение

# mobileWalletSignMessagesRequest
source: {appName} is requesting you to sign {count} message(s)
es: {appName} le solicita que firme {count} mensaje(s)
fr: {appName} vous demande de signer {count} message(s)
pt: {appName} está solicitando que você assine {count} mensagem(ns).
ru: {appName} просит вас подписать {count} сообщение(й)

# mobileWalletSignTransactions
source: Sign Transaction
es: Firmar transacción
fr: Signer la transaction
pt: Assinar transação
ru: Подписать транзакцию

# mobileWalletSignTransactionsRequest
source: {appName} is requesting you to sign {count} transaction(s)
es: {appName} le solicita que firme {count} transacción(s)
fr: {appName} vous demande de signer {count} transaction(s)
pt: {appName} está solicitando que você assine {count} transação(ões).
ru: {appName} запрашивает у вас подпись {count} транзакции(й)

# mobileWalletTitle
source: Espresso Cash Wallet
es: Billetera Espresso Cash
fr: Portefeuille Espresso Cash
pt: Carteira Espresso Cash
ru: Кошелек Espresso Cash

# moneyReceived
source: Money has been received
es: Se ha recibido dinero
fr: L'argent a bien été reçu
pt: Dinheiro recebido
ru: Деньги были получены

# moreDetails
source: View more details
es: Ver más detalles
fr: Afficher plus de détails
pt: Ver mais detalhes
ru: Просмотреть подробнее

source: Next
es: Siguiente
fr: Suivant
pt: Próximo
ru: Следующий

source: No
fr: Non
pt: Não
ru: Нет

# noActivity
source: No activity yet!
es: ¡Aún no hay actividad!
fr: Pas d'activité pour le moment !
pt: Nenhuma atividade ainda!
ru: Пока никакой активности!

# noEmailInCryptoInfo
source: With Espresso Cash, there’s no need for an email and password to access your money!
es: Con Espresso Cash, ¡no hay necesidad de un correo electrónico y una contraseña para acceder a su dinero!
fr: Avec Espresso Cash, il n'y a pas besoin d'un e-mail et d'un mot de passe pour accéder à votre argent!
pt: Com Espresso Cash, não há necessidade de email e senha para acessar seu dinheiro!
ru: С Espresso Cash нет необходимости в электронной почте и пароле для доступа к вашим деньгам!

# noEmailInCryptoParagraph
source: You need a secret recovery phrase. This phrase is composed of randomly generated security words which will be provided to you. Without these words, you will not be able to access your funds. These words can never be recovered. Keep them safe!
es: Necesitas una frase de recuperación secreta. Esta frase está compuesta por palabras de seguridad generadas al azar que se le proporcionarán. Sin estas palabras, no podrá acceder a sus fondos. Estas palabras nunca se pueden recuperar. ¡Mantenlos a salvo!
fr: Vous avez besoin d'une phrase de récupération secrète. Cette phrase est composée de 12 mots qui ont été générés au hasard et qui vous sont fournis. Sans ces mots, vous ne pourrez pas accéder à vos fonds. Ces mots ne peuvent jamais être récupérés. Garde les en sécurité!
pt: Você precisa de uma frase de recuperação secreta. Essa frase é composta por palavras de segurança geradas aleatoriamente que serão fornecidas a você. Sem essas palavras, você não poderá acessar seu dinheiro. Essas palavras nunca podem ser recuperadas. Mantenha-as em um lugar seguro!
ru: Вам нужна секретная фраза для восстановления. Эта фраза состоит из случайно сгенерированных секретных слов, которые будут предоставлены вам. Без этих слов вы не сможете получить доступ к своим средствам. Эти слова никогда не смогут быть восстановлены. Берегите их!

source: No results found
es: Sin resultados encontrados.
fr: Aucun résultat trouvé
ru: Результатов не найдено

# offRampCancelSubtitle
source: Are you sure you want to cancel this withdrawal?
es: ¿Estás seguro(a) de que quieres cancelar este retiro?
fr: Êtes-vous sûr(e) de vouloir annuler ce retrait ?
ru: Вы уверены, что хотите отменить этот вывод средств?

# offRampCancelTitle
source: Cancel Withdrawal
es: Cancelar retiro
fr: Annuler le retrait
ru: Отменить вывод средств

# offRampDepositError
source: There was an issue with your withdrawal.
es: Hubo un problema con tu retiro
fr: Il y a eu un problème avec votre retrait
pt: Houve um problema com sua retirada.
ru: Возникла проблема с выводом средств.

# offRampReceiveAmount
source: You'll receive {value}
es: Recibirás {value}
fr: Vous recevrez {value}
ru: Вы получите {value}

# offRampTopPartnerTitle
source: Withdraw To Your Bank Account
es: Retira a tu cuenta bancaria usando nuestro principal socio
fr: Encaissez sur votre compte bancaire en utilisant notre meilleur partenaire
ru: Выводите наличные на банковский счет с помощью нашего ведущего партнера

# offRampWaitingForPartner
source: Your money is on the way
es: Tu dinero está en camino
fr: Votre argent est en route
pt: Seu dinheiro está a caminho
ru: Ваши деньги уже в пути

# offRampWithdrawalFailure
source: There was an issue with your withdrawal. Please contact us.
es: Hubo un problema con tu retiro. Por favor, contáctanos.
fr: Il y a eu un problème avec votre retrait. Veuillez nous contacter.
pt: Houve um problema com sua retirada. Por favor, entre em contato conosco.
ru: Возникла проблема с выводом средств. Пожалуйста, свяжитесь с нами.

# offRampWithdrawCancelled
source: {amount} withdrawal successfully canceled.
es: {amount} retiro cancelado exitosamente.
fr: {amount} retrait annulé avec succès.
ru: {amount} вывод средств успешно отменен.

# offRampWithdrawCancelledTitle
source: Withdrawal has been canceled
es: El retiro ha sido cancelado
fr: Le retrait a été annulé
pt: A retirada foi cancelada
ru: Вывод средств отменен

# offRampWithdrawInitiated
source: Withdrawal initiated
es: Retiro iniciado
fr: Retrait initié
ru: Начат вывод средств

# offRampWithdrawNotice
source: Withdrawals can normally take up to 3 business days to receive.
es: Los retiros normalmente pueden tardar hasta 3 días hábiles en recibirse.
fr: Les retraits peuvent normalement prendre jusqu'à 3 jours ouvrables pour être reçus.
ru: Получение средств на вывод средств обычно может занять до 3 рабочих дней.

# offRampWithdrawOngoing
source: Sending {amount}
es: Enviando {amount}
fr: Envoi de {amount}
ru: Отправка {amount}

# offRampWithdrawReceived
source: Money has been received
es: Se ha recibido dinero
fr: L'argent a été reçu
pt: O dinheiro foi recebido
ru: Деньги получены

# offRampWithdrawSent
source: USDC sent to partner
es: USDC enviado al socio
fr: USDC envoyé au partenaire
pt: USDC enviado ao parceiro
ru: USDC отправлен партнеру

# offRampWithdrawSuccess
source: Your withdrawal was successful.
es: Tu retiro se realizó con éxito.
fr: Votre retrait a été effectué avec succès.
ru: Ваш вывод средств прошел успешно.

# offRampWithdrawTitle
source: Withdrawal
es: Progreso de retiro
fr: Progression du retrait
ru: Ход вывода средств

source: OK
ru: ОК

# onboardingIntro
source: A faster, simpler way to send & receive money.
es: La forma más rápida y simple de enviar y recibir dinero.
fr: Un moyen plus simple d'envoyer et de recevoir de l'argent.
pt: Uma forma rápida e simples de enviar & receber dinheiro.
ru: Получать и отправлять деньги быстрее и проще.

# onboardingNoticeFinishSetup
source: Finish
es: Finalizar
fr: Terminer
pt: Concluir configuração
ru: Завершить настройку

# oneMonth
source: 1 month
es: 1 mes
fr: 1 mois
pt: 1 mês
ru: 1 месяц

# oneWeek
source: 1 week
es: 1 semana
fr: 1 semaine
pt: 1 semana
ru: 1 неделя

# onRampAwaitingFunds
source: Hang tight. Your order is being processed.
es: Espera un momento. Tu pedido se está procesando.
fr: Attendez un instant. Votre transaction est en cours de traitement.
ru: Ожидайте. Ваш заказ обрабатывается.

# onRampDepositExpired
source: Your order has expired. Please try again.
es: Tu pedido ha caducado. Por favor, inténtalo de nuevo.
fr: Votre demande a expiré. Veuillez réessayer.
ru: Срок действия вашего заказа истек. Пожалуйста, попробуйте снова.

# onRampDepositFailure
source: There was an issue with your deposit. Please contact us.
es: Hubo un problema con tu depósito. Por favor, contáctanos.
fr: Il y a eu un problème avec votre dépôt. Veuillez nous contacter.
ru: Возникла проблема с вашим депозитом. Пожалуйста, свяжитесь с нами.

# onRampDepositInitiated
source: Deposit initiated
es: Depósito iniciado
fr: Dépôt initié
ru: Внесение начато

# onRampDepositOngoing
source: Depositing {amount}
es: Depositando {amount}
fr: Dépôt de {amount}
ru: Внесение депозита {amount}

# onRampDepositReceived
source: USDC received
es: USDC recibido
fr: USDC reçu
ru: USDC получил

# onRampDepositSuccess
source: Your deposit was successful.
es: Tu depósito se realizó con éxito.
fr: Votre dépôt a été effectué avec succès.
ru: Ваш депозит был внесен успешно.

# onRampDepositTitle
source: Add Cash Progress
es: Progreso de añadir efectivo
fr: Status d'ajout d'argent
ru: Добавить денежный прогресс

# onRampLocalTransferTile
source: Local currency transferred Amount sent: {amount} {name}: {account}
es: Moneda local transferida Monto enviado: {amount} {name}: {account}
fr: Devise locale transférée Montant envoyé : {amount} {name}: {account}
ru: Переведено в местной валюте Отправленная сумма: {amount} {name}: {account}

# onRampTopPartnerTitle
source: Transfer Money Into Your Espresso Account
es: Transfiere dinero a Espresso utilizando nuestro principal socio de pago
fr: Transférez de l'argent vers Espresso en utilisant notre meilleur partenaire de paiement
ru: Переведите деньги в Espresso с помощью нашего ведущего платежного партнера

# operationSend
source: sent
es: enviada
fr: envoyer
pt: enviada
ru: отправлено

# orderId
source: Order ID: {orderId}
ru: Идентификатор заказа: {orderId}

# outgoingSplitKeyPayments_btnCancel
source: Cancel transfer
es: Cancelar la transferencia
fr: Annuler le transfert
pt: Cancelar transferência
ru: Отменить перевод

# outgoingSplitKeyPayments_lblCancelConfirmationSubtitle
source: Are you sure you want to cancel this transfer?
es: ¿Estás seguro que quieres cancelar esta transferencia?
fr: Êtes-vous sûr de vouloir annuler ce transfert?
pt: Tem certeza de que deseja cancelar esta transferência?
ru: Вы уверены, что хотите отменить этот перевод?

# outgoingSplitKeyPayments_lblCancelConfirmationTitle
source: Cancel Transfer
es: Cancelar la transferencia
fr: Annuler le transfert
pt: Cancelar transferência
ru: Отменить перевод

# outgoingSplitKeyPayments_lblMoneyWithdrawn
source: The money has already been withdrawn.
es: El dinero ya ha sido retirado.
fr: L'argent a déjà été retiré.
pt: O dinheiro já foi retirado.
ru: Деньги уже сняты.

# outgoingTransferSuccess
source: {amount} has been sent
es: {amount} ha sido enviado
fr: {amount}a été envoyé
pt: {amount} foi enviado
ru: {amount} были отправлены

source: Pay
es: Pagar
fr: Payer
pt: Pagar
ru: Оплатить

source: Payment initiated
es: Pago iniciado
fr: Paiement initié
pt: Pagamento iniciado
ru: Платеж инициирован

# paymentRequestCancel
source: Cancel request
es: Cancelar la solicitud de pago
fr: Annuler la demande
pt: Cancelar solicitação
ru: Отменить запрос

# paymentRequestFailureNotificationTitle
source: Failed payment of {amount}.
es: Pago fallido de {amount}.
fr: Paiement échoué de {amount}.
pt: Falha no pagamento de {amount}.
ru: Не удалось произвести оплату {amount}.

# paymentRequest_lblCancelConfirmationSubtitle
source: Are you sure you want to cancel this payment request?
es: ¿Estás seguro que desea cancelar esta solicitud de pago?
fr: Êtes-vous sûr que vous souhaitez annuler cette demande de paiement?
pt: Tem certeza de que deseja cancelar esta solicitação de pagamento?
ru: Вы уверены, что хотите отменить этот платежный запрос?
