Repository: peerwaya/cryptoplease-dart
Catalog: packages/espressocash_app/lib/l10n/intl_*.arb
Languages: es, fr, pt, ru

# paymentRequest_lblCancelConfirmationTitle
source: Cancel Payment Request
es: Cancelar la solicitud de pago
fr: Annuler la demande de paiement
pt: Cancelar a solicitação de pagamento
ru: Отменить платежный запрос

# paymentRequestTitle
source: Payment request
es: Solicitud de pago
fr: Demande de paiement
pt: Solicitação de pagamento
ru: Запросить оплату

source: Pending
es: Pendiente
fr: En attente
pt: Pendentes
ru: Незавершено

source: Photo Library
es: Librería fotográfica
fr: Galerie de photos
pt: Galeria
ru: Галерея

source: Privacy Policy
es: Política de privacidad
fr: Politique de confidentialité
pt: Política de Privacidade
ru: Политика конфиденциальности

# profile_lblCamera
source: Camera
fr: Caméra
pt: Câmera
ru: Камера

source: Protect Wallet
es: Proteger la billetera
fr: Protéger le portefeuille
pt: Proteger Carteira
ru: Защитите кошелек

# protectWalletTitle
source: WALLET PROTECTION
es: PROTECCION DE LA BILLETERA
fr: Protection du portefeuille
pt: PROTEÇÃO DA CARTEIRA
ru: ЗАЩИТА КОШЕЛЬКА

# protectYourWalletParagraph1
source: Don't risk losing your funds. Protect your wallet by saving your secret recovery phrase in a place you trust.
es: No se arriesgue a perder sus fondos. Proteja su billetera guardando su frase de recuperación secreta en un lugar en el que confíe.
fr: Ne risquez pas de perdre vos fonds. Protégez votre portefeuille en stockant votre phrase de récupération secrète dans un endroit en qui vous avez confiance.
pt: Não corra o risco de perder seu dinheiro.Proteja sua carteira salvando sua frase de recuperação secreta em um lugar confiável.
ru: Не рискуйте потерять свои средства. Защитите свой кошелек, сохранив секретную фразу для восстановления в месте, которому вы доверяете.

# protectYourWalletParagraph2
source: It's the only way to recover your wallet if you get locked out of the app or get a new device.
es: Es la única forma de recuperar su billetera si se bloquea de la aplicación u obtiene un nuevo dispositivo.
fr: C'est la seule façon de récupérer votre portefeuille si vous êtes déconnecté de l'application ou si vous changez d'appareil.
pt: É a única maneira de recuperar sua carteira se você sair do aplicativo ou obter um novo dispositivo.
ru: Это единственный способ восстановить свой кошелек, если вы заблокируете доступ к приложению или приобретете новое устройство.

# qrCameraPermissionMessage
source: Allow camera access in your device settings to enable the QR Code reader.
es: Permita el acceso a la cámara en la configuración de su dispositivo para habilitar el lector de código QR.
fr: Autorisez l'accès à la caméra dans les paramètres de votre appareil pour activer le lecteur de code QR.
pt: Permita o acesso à câmera nas configurações do seu dispositivo para ativar o leitor de QR Code.
ru: Разрешите доступ к камере в настройках вашего устройства, чтобы включить считыватель QR-кодов.

# qrCameraPermissionTitle
source: Camera disabled
es: Cámara discapacitada
fr: Caméra inaccessible
pt: Câmera desativada
ru: Камера отключена

# qrCodeScanErrorContent
source: We were unable to understand this QR code. Please try again.
es: No pudimos entender este código QR. Inténtalo de nuevo.
fr: Nous n'avons pas pu comprendre ce code QR. Veuillez réessayer.
pt: Não conseguimos processar esse QR code. Por favor, tente novamente.
ru: Мы не смогли распознать этот QR-код. Пожалуйста, попробуйте снова.

# qrCodeScanErrorTitle
source: Scan Failed
es: Escaneo falló
fr: Échec du scan
pt: Falha ao escanear QR code
ru: Сканирование не удалось

# rampAmountEquivalent
source: You will get approx. {amount}
es: Trendrás aproximadamente.
fr: Vous obtiendrez env. {amount}
ru: Вы получите приблизительно {amount}

# rampBasicInfoRequired
source: To get started, we need some basic information from you.
es: Para comenzar, necesitamos informacion basica sobre ti.
fr: Pour commencer, nous avons besoin de quelques informations de votre part.
ru: Чтобы начать, нам нужна от вас некоторая базовая информация.

# ramp_btnAddCash
source: Deposit
es: Depositar
fr: Déposer
pt: Depositar
ru: Внести

# ramp_btnCashOut
source: Withdraw
es: Retirar
fr: Retirer
pt: Sacar
ru: Вывести

# ramp_btnContinue
source: Continue
es: Continuar
fr: Continuer
ru: Продолжать

# rampMinimumTransferAmount
source: Minimum amount to transfer {amount}
es: Monto minimo a transferir.
fr: Montant minimum à transférer {amount}
ru: Минимальная сумма для перевода {amount}

# receive
source: Request
es: Recibir
fr: Recevoir
pt: Solicitar
ru: Запросить

# recentActivityEmpty
source: There is no recent activity. Do you want to send money to family now?
es: No hay actividad reciente. ¿Deseas enviar dinero a la familia ahora?
fr: Il n'y a pas d'activité récente. Souhaitez-vous envoyer de l'argent à la famille maintenant?
ru: Недавней активности нет. Вы хотите отправить деньги семье прямо сейчас?

# recentActivityLbl
source: Recent Activity
es: Actividad reciente
fr: Activité récente
ru: Недавняя активность

# recentActivitySeeAll
source: See All
ru: Увидеть все

# reEnterPasscode
source: Re-enter your passcode
es: Vuelva a ingresar su código de acceso
fr: Réentrez votre code d'accès
pt: Insira sua senha novamente
ru: Повторно введите пин-код

source: Remind me later
es: Recuérdame más tarde
fr: Rappellez-moi plus tard
pt: Lembre-me mais tarde
ru: Напомнить позже

# requestOrSendPayment
source: Pay or Request
es: Enviar o Solicita
fr: Envoyer ou Demander
pt: Enviar ou Solicitar
ru: Отправить или запросить

# resendLink
source: Resend
es: Reenviar enlace
fr: Réenvoyer le lien
pt: Reenviar links
ru: Отправить ссылки еще раз

source: Retry
es: Procesar de nuevo
fr: Reessayer
pt: Tentar novamente
ru: Повторить

source: Save
es: Guardar
fr: Sauvegarder
pt: Salvar
ru: Сохранить

# scanToReceive
source: Scan QR code to receive
es: Escanea para recibir
fr: Scannez pour recevoir
pt: Digitalize para receber
ru: Сканируйте, чтобы получить

# scanToSend
source: Scan QR code to pay
es: Escanear para enviar
fr: Scanner pour envoyer
ru: Отсканировать для отправки

# searchPlaceholder
source: Search...
es: Buscar...
fr: Recherche...
pt: Buscar...
ru: Поиск...

# securitySectionTitle
source: SECURITY AND PRIVACY
es: SEGURIDAD Y PRIVACIDAD
fr: SECURITE ET CONFIDENTIALITE
pt: SEGURANÇA E PRIVACIDADE
ru: БЕЗОПАСНОСТЬ И КОНФИДЕНЦИАЛЬНОСТЬ

# selectCountryTitle
source: SELECT YOUR COUNTRY
es: SELECCIONA TU PAÍS
fr: SELECTIONNER VOTRE PAYS
ru: ВЫБЕРИТЕ СТРАНУ

source: Send as
es: Enviar como
fr: Envoyer comme
pt: Enviar como
ru: Отправить как

# sendExplanation
source: Once you’ve created this link, you can send it to your recipient! They can then redeem the funds by simply clicking the link.
es: Una vez que hayas creado este enlace, puedes enviarlo a tu destinatario. Ellos podrán canjear los fondos simplemente haciendo clic en el enlace.
fr: Une fois que vous avez créé ce lien, vous pouvez l'envoyer à votre destinataire ! Ils pourront ensuite récupérer les fonds en cliquant simplement sur le lien.
pt: Depois de criar este link, você pode enviá-lo ao seu destinatário! O dinheiro pode ser recebido simplesmente clicando nos links.
ru: Как только вы создадите эту ссылку, вы можете отправить ее своему получателю! Он сможет получить отправленные средства, просто перейдя по ссылкам.

source: Send Money
es: Enviar dinero
fr: Envoyer
pt: Enviar
ru: Отправить деньги

# sentDirectly
source: Sent
es: Enviada
fr: Envoyé
pt: Enviado
ru: Отправлено

source: Sent via link
es: Enviado por enlace
fr: Envoyé via un lien
pt: Enviado via links
ru: Отправлено по ссылкам

# setReminder
source: SET A REMINDER FOR {duration}
es: Establecer un recordatorio para{duration}
fr: Définissez un rappel pour {duration}
pt: DEFINIR UM LEMBRETE PARA {duration}
ru: УСТАНОВИТЕ НАПОМИНАНИЕ НА {duration}

source: Share
es: Compartir
fr: Partager
pt: Compartilhar
ru: Поделиться

# shareInstructions
source: To receive it, you need to click on the link:
es: Para recibirlo, debes hacer clic en el enlace:
fr: Pour les recevoir, tu dois cliquer sur ce lien :
pt: Para receber, você precisa clicar em dois links. Siga estas duas etapas abaixo:
ru: Чтобы получить их, вам нужно перейти по двум ссылкам. Выполните следующие два шага:

# shareIntroFt
source: Hi! I’ve just sent you
es: ¡Hola! Te acabo de enviar
fr: Hello! Je viens de t'envoyer
pt: Olá! Acabei de te enviar
ru: Привет! Я только что отправил вам

# sharePaymentRequestLinkInstructions
source: To pay me with one click, visit:
es: Para pagarme con un clic, visite:
fr: Pour me payer en un seul clic, visite:
pt: Para me pagar com um clique, visite:
ru: Чтобы заплатить мне одним нажатием, откройте ссылку:

# sharePaymentRequestLinkIntro
source: Hi! I have sent a request for
es: Hola! He enviado una solicitud de
fr: Hello! Je t'envoie une demande de paiement
pt: Olá! Enviei uma solicitação de
ru: Привет! Я отправил запрос на

# sharePaymentRequestLinkMessage
source: Hi! I have sent a request for {amount}. To pay me with one click, visit: {link}
es: Hola! He enviado una solicitud de {amount}. Para pagarme con un clic, visite: {link}
fr: Hello! Je t'envoie une demande de paiement de {amount}. Pour me payer en un seul clic, visite: {link}
pt: Olá! Enviei uma solicitação de {amount}. Para me pagar com um clique, visite: {link}
ru: Привет! Я отправил запрос на {amount}. Чтобы заплатить мне одним нажатием, откройте ссылку: {link}

# sharePaymentRequestTitle
source: Request has been created!
es: ¡Se ha creado una solicitud!
fr: La demande a été créée!
pt: Solicitação criada!
ru: Запрос создан!

# shareText
source: Hi! I've just sent you {amount}. To receive it, you need to click on the link: {firstLink}
ru: Привет! Я только что отправил вам {amount}. Чтобы получить их, вам нужно перейти по ссылке: {firstLink}

# signIn1
source: Already have a wallet?
es: ¿Ya tienes una billetera?
fr: Vous avez déjà un portefeuille ?
pt: Já tem uma carteira Solana?
ru: У вас уже есть кошелек Solana?

# signIn2
source: Continue here
es: Haz clic aquí
fr: Continuez ici
pt: Continue aqui
ru: Продолжить здесь

# signIn_lblByCreatingWalletYouAgree
source: By creating a wallet or using an existing wallet, you agree to our
es: Al crear una billetera o usar una billetera existente, usted acepta nuestro
fr: En créant un portefeuille ou en utilisant un portefeuille existant, vous acceptez nos
pt: Ao criar uma carteira ou usar uma carteira existente, você concorda com os nossos
ru: Создавая кошелек или используя существующий кошелек, вы соглашаетесь с нашими

# signOut
source: Delete Wallet
es: Eliminar la billetera
fr: Supprimer le portefeuille
pt: Apagar Carteira
ru: Удалить кошелек

# signOutConfirmation
source: Are you sure you want to delete the wallet?
es: ¿Estás seguro de que quieres eliminar la billetera?
fr: Êtes-vous sûr de vouloir supprimer le portefeuille?
pt: Tem certeza que você deseja apagar a carteira?
ru: Вы уверены, что хотите удалить кошелек?

# signUp
source: Create Wallet
es: Crear billetera
fr: Créer un portefeuille
pt: Criar carteira
ru: Создать кошелек

# splitKeyCanceledMessage1
source: {amount} Transaction successfully canceled.
es: {amount} Transacción cancelada con éxito.
fr: {amount} transaction a été annulé.
pt: Transação de {amount} cancelada com sucesso.
ru: Транзакция {amount} успешно отменена.

# splitKeyCancelErrorMessage
source: There was an issue canceling your transfer.
es: Hubo un problema cancelando su transferencia.
fr: Il y a eu un problème en annulant votre transfert.
pt: Houve um problema cancelando sua transferência.
ru: Возникла проблема с отменой вашего перевода.

# splitKeyErrorMessage2
source: There was an issue with your transfer.
es: Hubo un problema con su transferencia.
fr: Il y avait un problème avec votre transfert.
pt: Houve um problema com sua transferência.
ru: Возникла проблема с вашим переводом.

# splitKeyErrorRetry
source: Please retry.
es: Por favor, intenta de nuevo.
fr: Veuillez réessayer.
pt: Por favor tente novamente.
ru: Пожалуйста, повторите попытку.

# splitKeyProgressCanceled
source: Transfer has been canceled
es: La transferencia ha sido cancelada
fr: Le transfert a été annulé
pt: Transferência cancelada
ru: Перевод был отменен

# splitKeyProgressCanceling
source: Canceling transfer
es: Cancelando transferancia
fr: Annulation du transfert
pt: Cancelar transferência
ru: Отмена перевода

# splitKeyProgressCreated
source: Link is created
es: El enlace ha sido creado.
fr: Le lien a été créé
pt: Links criados
ru: Ссылка готова

# splitKeyProgressOngoing
source: Sending {amount} using secure link...
es: Enviando {amount} usando enlace seguro...
fr: Envoi de {amount} en utilisant un lien sécurisé ...
pt: Enviando {amount} com links seguros...
ru: Отправка {amount} по защищенной ссылке...

# splitKeyProgressSuccess
source: Money has been successfully received
es: El dinero ha sido recibido con éxito
fr: L'argent a été reçu avec succès
pt: Dinheiro recebido com sucesso
ru: Деньги были успешно получены

# splitKeySuccessMessage2
source: Your transfer has been sent.
es: Su transferencia ha sido enviada.
fr: Votre transfert a été envoyé.
pt: Sua transferência foi enviada.
ru: Ваш перевод был отправлен.

# splitKeyTransferTitle
source: TRANSFER PROGRESS
es: Avance de transferencia
fr: Transfert en cours
pt: PROGRESSO DA TRANSFERÊNCIA
ru: ПРОЦЕСС ПЕРЕДАЧИ

# swapErrorTitle
source: There's a problem
es: Hay un problema
fr: Il y a un problème
pt: Houve um problema
ru: Есть проблема

# swapFailUnknown
source: An unkown error ocurred while submitting your transaction
es: Se produjo un error desconocido al enviar su transacción
fr: Une erreur inconnue s'est produite lors de la soumission de votre transaction
pt: Ocorreu um erro desconhecido ao enviar sua transação
ru: При отправке транзакции произошла неизвестная ошибка

source: Terms
es: Condiciones de uso
fr: conditions d'utilisation
pt: Termos
ru: Условия

source: Terms of Use
es: Condiciones de uso
fr: Conditions d'utilisation
pt: Termos de Uso
ru: Условия использования

source: To
es: A
fr: Pour
pt: Para
ru: Кому

# todayAt
source: Today at {time}
es: Hoy en {time}
fr: Aujourd'hui à {time}
pt: Hoje às {time}
ru: Сегодня в {time}

# tokenEquivalent
source: Equivalent to {value}
es: Equivalente a {value}
fr: Équivalent à {value}
pt: Equivalente a {value}
ru: Эквивалентно {value}

source: Tomorrow
es: Mañana
fr: Demain
pt: Amanhã
ru: Завтра

# toRestoreYourAccount
source: Please enter your secret recovery phrase below. This phrase is composed of random generated 12 words.
es: Ingrese su frase de recuperación secreta a continuación. Esta frase está compuesta de 12 palabras generadas aleatorias.
fr: Veuillez saisir votre phrase de récupération secrète ci-dessous. Cette phrase est composée de 12 mots générés aléatoires.
pt: Por favor, insira sua frase de recuperação secreta abaixo. Esta frase é composta por 12 palavras geradas aleatoriamente.
ru: Введите ниже секретную фразу восстановления. Эта фраза состоит из случайно сгенерированных 12 слов.

source: Transactions
es: Transacciónes
pt: Transações
ru: Транзакции

# transferErrorTitle
source: OOPS!
es: UPS!
ru: Ой!

# transferSuccessTitle
source: SUCCESS!
es: ¡ÉXITO!
pt: SUCESSO!
ru: УСПЕШНО!

# tryAgainLater
source: Please, try again later
es: Por favor, inténtelo de nuevo más tarde
fr: Veuillez réessayer plus tard
pt: Por favor, tente novamente mais tarde
ru: Пожалуйста, попробуйте позже

# usdcExplanation
source: The USD Coin (USDC) is a digital stablecoin that should be fixed to the United States dollar.
es: El USDC es una criptomoneda estable que suele mantener un valor equivalente al dólar Estadounidense.
fr: L'USDC est un stablecoin numérique qui est normalement fixé au dollar américain.
pt: O USD Coin (USDC) é uma moeda digital estável (Stablecoin) vinculada ao dólar dos Estados Unidos.
ru: USD Coin (USDC) - это цифровая стабильная монета, которая должна быть привязана к доллару США.

# usdcInfo
source: The US Dollar Coin (USDC) is a digital stablecoin that should be fixed to the United States dollar. ($1 = 1USDC)
es: El USDC es una criptomoneda estable que suele mantener un valor equivalente al dolar Estadounidense. ($1 = 1USDC)
fr: L'USDC est un stablecoin numérique qui devrait être fixé au dollar américain.(1$ = 1USDC)
pt: O US Dollar Coin (USDC) é uma moeda digital estável (Stablecoin) vinculada ao dólar dos Estados Unidos. ($1 = 1USDC)
ru: US Dollar Coin (USDC) - это стейблкоин, цифровая стабильная монета, которая должна быть привязана к доллару США. ($1 = 1USDC).

# version
source: Version {versionNumber} ({buildNumber})
pt: Versão {versionNumber} ({buildNumber})
ru: Версия {versionNumber} ({buildNumber})

# viewRecoveryPhrase
source: View secret recovery phrase
es: Ver frase de recuperación secreta
fr: Voir la phrase de récupération secrète
pt: Ver a frase de recuperação secreta
ru: Просмотреть секретную фразу восстановления

# viewRecoveryPhraseDescription
source: Words generated by your crypto wallet
es: Palabras generadas por su billetera criptográfica
fr: Mots générés par votre portefeuille crypto
pt: Palavras geradas pela sua carteira cripto
ru: Слова, сгенерированные вашим криптокошельком

source: View Transaction
es: Ver transacción
fr: Afficher la transaction
pt: Visualizar Transação
ru: Просмотреть транзакцию

source: Wallet Address
es: Dirección de billetera
fr: Adresse du portefeuille
ru: Адрес кошелька

# walletAddressFieldHint
source: Type, Paste or Scan Address Here
es: Escribe, pega o escanea la dirección aquí.
fr: Tapez, collez ou scannez l'adresse ici.
ru: Введите, вставьте или отсканируйте адрес здесь

# walletEspressoPayLabel
source: Pay anyone by sharing the payment link using any messaging platform
es: Envía dinero a cualquier persona utilizando una plataforma de mensajería.
fr: Envoyez de l'argent à n'importe qui en utilisant une plateforme de messagerie.
ru: Отправляйте деньги любому, кто использует платформу обмена сообщениями.

# walletNetworks
source: Networks
es: Redes
fr: Réseaux
ru: Сети

# walletPayOther
source: Want to pay using a wallet address?
es: Otra Opción De Pago:
fr: Autre Option De Paiement :
ru: Другой способ оплаты:

# walletSendToAddressTitle
source: Wallet Address
es: ENVIAR A UNA DIRECCIÓN DE BILLETERA
fr: ENVOYER À UNE ADRESSE DE PORTEFEUILLE
ru: ОТПРАВИТЬ НА АДРЕС КОШЕЛЬКА

# walletTransactionMethodTitle
source: Send Money
es: MÉTODO DE TRANSACCION
fr: TYPE DE TRANSACTION
ru: СПОСОБ СОВЕРШЕНИЯ ТРАНЗАКЦИИ

# weWereUnableToFetchTokenPrice
source: We were unable to fetch token prices.
es: No pudimos alcanzar los precios de los tokenses.
fr: Nous n'avons pas pu récupérer les prix des jetons.
pt: Não conseguimos atualizar os preços dos tokens.
ru: Нам не удалось получить цены токенов.

source: Yes
es: Sí
fr: Oui
pt: Sim
ru: Да

# yourEmailDisclaimer
source: Your email address is stored locally and only shared with partners for the purposes of adding cash and cashing out.
es: Tu dirección de correo electrónico se guarda únicamente localmente y se comparte solamente con los socios de ingreso y salida de efectivo.
fr: Votre email n'est stocké que localement et il n'est partagé qu'àvec nos partenaires lors des opérations de dépôt et de retrait.
ru: Ваш адрес электронной почты хранится только локально и предоставляется только партнерам по вводу и обналичиванию средств

# yourEmailPlaceholder
source: Email Address
es: Correo electrónico
fr: Adresse e-mail
ru: Адрес электронной почты

# yourFirstNamePlaceholder
source: First Name
es: Elige un nombre de usuario
fr: Choisissez un nom d'utilisateur
pt: Escolha um nome de usuário
ru: Ваше имя

# yourRecoveryPhrase
source: Your Secret Recovery Phrase
es: Tu frase de recuperación secreta
fr: Votre phrase de récupération secrète
pt: Sua Frase de Recuperação Secreta
ru: Ваша секретная фраза восстановления

# yourRecoveryPhraseSub
source: This phrase is composed of randomly generated 12 words. Please write down your following secret recovery phrase and save it carefully.
es: Esta frase está compuesta por 12 palabras generadas al azar. Por favor, anota tu siguiente frase secreta de recuperación y guárdala cuidadosamente.
fr: Cette phrase est composée de 12 mots générés aléatoirement. Veuillez noter votre phrase secrète de récupération suivante et la sauvegarder attentivement.
pt: Por favor, digite sua frase de recuperação secreta a seguir e salve-a com cuidado. Essa frase é composta de 12 palavras geradas aleatoriamente. Você não poderá recuperar seu dinheiro se perder essas palavras.
ru: Пожалуйста, запишите следующую секретную фразу для восстановления и тщательно сохраните ее. Эта фраза состоит из случайно сгенерированных 12 слов. Вы не сможете вернуть свои средства, если потеряете эти слова.

# zeroAmountMessage
source: Please enter an amount greater than zero to be {operation}.
es: Ingrese una cantidad mayor que cero para ser {operation}.
fr: Veuillez saisir un montant supérieur à zéro pour être{operation}.
pt: Por favor, insira uma quantia maior que zero para ser {operation}.
ru: Пожалуйста, введите сумму больше нуля.

# zeroAmountTitle
source: Invalid amount
es: Monto invalido
fr: Montant invalide
pt: Quantia inválida
ru: Недопустимая сумма
